ruby/rails_ii/14_secrets#destroy/app/views/users/show.html.erb

SELECT "secrets".* FROM "secrets" WHERE "secrets"."user_id" = $1  [["user_id", 1]]
---
    <h2><%= @user.name %>'s' Secrets:</h2>
    <% @user.secrets.each do |secret| %>