ruby/angular_on_rails/04_the_nba_association/app/controllers/players_controller.rb

INSERT INTO "players" ("first_name", "last_name", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "adsf"], ["last_name", "sdaf"], ["team_id", 7], ["created_at", "2016-06-27 22:28:21.482218"], ["updated_at", "2016-06-27 22:28:21.482218"]]
---
  def create
    Player.create(player_params)

DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 4]]
---
 def destroy
  Player.find(params[:id]).destroy