ruby/angular_on_rails/04_the_nba_association/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    render :json => Team.all

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Boston Celtics"], ["created_at", "2016-06-27 19:02:59.558897"], ["updated_at", "2016-06-27 19:02:59.558897"]]
---
  def create
    Team.create(team_params)

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 2]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
---
 def destroy
  Team.find(params[:id]).destroy