ruby/rails_ii/14_secrets#destroy/app/controllers/secrets_controller.rb

  def index
    @secrets=Secret.all
---
SELECT "secrets".* FROM "secrets"

  def create
    @secret = Secret.new(secret_params)
    @user = current_user
    @secret.user = @user
    @secret.save
---
INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "이럴수가"], ["user_id", 4], ["created_at", "2016-06-17 02:05:21.396387"], ["updated_at", "2016-06-17 02:05:21.396387"]]

  def destroy
    @user = current_user
    secret = Secret.where(id: secret_params[:id]).first
    secret.destroy
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1  ORDER BY "secrets"."id" ASC LIMIT 1  [["id", 7]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 7]]